CSI API ETABS v1
eWallSpandrelRebarLayerType Enumeration
 The pier rebar types.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eWallSpandrelRebarLayerType
Public Enumeration eWallSpandrelRebarLayerType
Dim instance As eWallSpandrelRebarLayerType
public enum class eWallSpandrelRebarLayerType
type eWallSpandrelRebarLayerType
Members
Member name | Value | Description
Horizontal_Top_Total | 1
Horizontal_Bottom_Total | 2
Horizontal_Distributed_Eachface | 3
Vertical_Ties_Distributed | 4
Diagonal_Each | 5
Remarks
See Also
Reference
ETABSv1 Namespace